<template>
    <div class="windows">
        
        <div class="windows-blocks">
            <div class="window-inform">
                <div class="inform-main">
                    <div class="main-image">
                        <img src="../assets/image_in_news.svg" alt="test image" style="width:100%">
                    </div>
                    <div class="window-title">
                        <h1>&lt;Название Новости&gt;</h1>
                    </div>
                    <div class="main-text">
                        <p>
                            Задача организации, в особенности же сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Не следует, однако забывать, что реализация намеченных плановых заданий требуют определения и уточнения новых предложений.
                            Значимость этих проблем настолько очевидна, что новая модель организационной деятельности способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт консультация с широким активом требуют от нас анализа существенных финансовых и административных условий. Товарищи! рамки и место обучения кадров в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Равным образом реализация намеченных плановых заданий позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. С другой стороны реализация намеченных плановых заданий требуют определения и уточнения модели развития.
                            Товарищи! укрепление и развитие структуры представляет собой интересный эксперимент проверки систем массового участия. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров способствует подготовки и реализации модели развития. Равным образом начало повседневной работы по формированию позиции требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. Таким образом начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. “рыбой”.
                        </p>
                    </div>
                    <div class="main-date">
                        <time datetime="18.03.2024">18.03.2024</time>
                    </div>
                </div>
            </div>
        </div>

  </div>
</template>

<script>
export default {
    name: 'News'
}
</script>


<style scoped>
.windows {
    display: flex;
    justify-content: center;
    align-items: center;
    flex-direction: column;
    padding-top: 5px; /* отступ от верха экрана */
}

.windows-blocks {
    width: 80%; /* или задайте нужную ширину контейнера */
}

.window-inform {
    display: flex;
    flex-direction: column;
    align-items: center;
}

.inform-main {
    width: 100%;
}

.main-image {
    display: flex;
    justify-content: center;
    margin-top: 5px; /* отступ от верха экрана */
}

.main-image img {
    max-width: 100%;
    height: auto;
}

.window-title {
    display: flex;
    justify-content: flex-start;
    width: 100%;
    margin-top: 10px;
}

.window-title h1 {
    font-size: 2em; /* задайте нужный размер шрифта */
}

.main-text {
    display: flex;
    justify-content: center;
    text-align: center;
    margin-top: 10px;
}

.main-date {
    display: flex;
    justify-content: center;
    margin-top: 10px;
    font-size: 0.9em; /* размер шрифта для даты */
    color: gray;
}
</style>
